Web/app/Controllers/UserController.php

INSERT INTO `users` (`username`, `password`) VALUES ('valent', '$2y$10$KkE6yGz2.PZ96OWSTYEgY.FHRs.fuL3spLsPVqROcTxVvYYucogfq')
---
    public function create()
    {
        if (!$this->validate([
            'username' => 'required|is_unique[users.username]',
            'password2' => 'matches[password]'
        ])) {
            $validation = \Config\Services::validation();

            return redirect()->to(base_url('register')); //->with('validation', $validation);
        }

        $this->userModel->save([
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
        ]);

SELECT *
FROM `users`
WHERE `username` = 'valent'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->userModel->where('username', $username)->first();